import time
import streamlit as st
def main(i):
    status_area = st.empty()
    count_down_sec = i
    for i in range(count_down_sec):
        time.sleep(1)
st.title("アニバーサリー総選挙2021 予想")
simulation=st.sidebar.radio("何をシミュレーションしますか？",("60連目をシミュレーション","累計報酬をシミュレーション"))
toba=st.sidebar.text_input('名前を入力してください', '調子くん')
team=st.sidebar.radio("自チーム",("福岡ソフトバンクホークス","千葉ロッテマリーンズ","埼玉西武ライオンズ","東北楽天ゴールデンイーグルス","北海道日本ハムファイターズ","オリックス・バファローズ","読売ジャイアンツ","阪神タイガース","中日ドラゴンズ","横浜DeNAベイスターズ","広島東洋カープ","東京ヤクルトスワローズ"))
if team=="福岡ソフトバンクホークス":
        te=0
elif team=="千葉ロッテマリーンズ":
        te=1
elif team=="埼玉西武ライオンズ":
        te=2
elif team=="東北楽天ゴールデンイーグルス":
        te=3
elif team=="北海道日本ハムファイターズ":
        te=4
elif team=="オリックス・バファローズ":
        te=5
elif team=="読売ジャイアンツ":
        te=6
elif team=="阪神タイガース":
        te=7
elif team=="中日ドラゴンズ":
        te=8
elif team=="横浜DeNAベイスターズ":
        te=9
elif team=="広島東洋カープ":
        te=10
elif team=="東京ヤクルトスワローズ":
        te=11
        
s1_players=["サンチェス","今村信貴","菅野智之","髙橋優貴","戸郷翔征","高梨雄平","中川皓太","大竹寛","鍵谷陽平","デラロサ","大城卓三","中島宏之","吉川尚輝","若林晃弘","岡本和真","坂本勇人","ウィーラー","亀井善行","丸佳浩","松原聖弥","梶谷隆幸",
            "青柳晃洋","福谷浩司","平良拳太郎","森下暢仁","石川雅規","秋山拓巳","柳裕也","濵口遥大","大瀬良大地","スアレス","西勇輝","大野雄大","大貫晋一","九里亜蓮","小川泰弘","ガンケル","小笠原慎之介","ピープルズ","床田寛樹","田口麗斗",
            "伊藤将司","勝野昌慶","阪口皓亮","野村祐輔","高梨裕稔","馬場皐輔","谷元圭介","山﨑康晃","菊池保則","梅野雄吾","岩崎優","福敬登","エスコバー","塹江敦哉","清水昇","岩貞祐太","祖父江大輔","平田真吾","ケムナ誠","マクガフ","小林慶祐",
            "又吉克樹","砂田毅樹","中田廉","今野龍太","スアレス","R.マルティネス","三嶋一輝","栗林良吏","石山泰稚","梅野隆太郎","木下拓哉","戸柱恭孝","會澤翼","西田明央",
            "マルテ","A.マルティネス","ソト","クロン","中村悠平","糸原健斗","ビシエド","牧秀悟","菊池涼介","内川聖一","大山悠輔","阿部寿樹","柴田竜拓","堂林翔太","松本友",
            "木浪聖也","高橋周平","宮崎敏郎","田中広輔","山田哲人","中野拓夢","京田陽太","大和","小園海斗","村上宗隆","サンズ","福田永将","倉本寿彦","長野久義","西浦直亨",
            "近本光司","根尾昂","佐野恵太","松山竜平","青木宣親","糸井嘉男","大島洋平","神里和毅","西川龍馬","塩見泰隆","佐藤輝明","平田良介","桑原将志","羽月隆太郎","山崎晃大朗",
            "陽川尚将","井領雅貴","オースティン","鈴木誠也","サンタナ","千賀滉大","石川歩","ニール","田中将大","バーヘイゲン","山岡泰輔","東浜巨","小島和哉","松本航","則本昂大","杉浦稔大","田嶋大樹",
            "石川柊太","美馬学","高橋光成","涌井秀章","上沢直之","山本由伸","武田翔太","岩下大輝","平井克典","早川隆久","加藤貴之","宮城大弥","和田毅","二木康太","今井達也","岸孝之","伊藤大海","山﨑福也"
            "嘉弥真新也","東條大樹","森脇亮介","酒居知史","井口和朋","比嘉幹貴","モイネロ","唐川侑己","平良海馬","ブセニッツ","宮西尚生","ヒギンス","泉圭輔","小野郁","ギャレット","牧田和久","堀瑞輝","山田修義",
            "岩嵜翔","佐々木千隼","宮川哲","宋家豪","B.ロドリゲス","富山凌雅","森唯斗","益田直也","増田達至","松井裕樹","秋吉亮","平野佳寿","甲斐拓也","田村龍弘","森友哉","太田光","宇佐見真吾","若月健矢",
            "中村晃","井上晴哉","山川穂高","銀次","中田翔","頓宮裕真","周東佑京","レアード","外崎修汰","浅村栄斗","渡邉諒","モヤ","牧原大成","中村奨吾","呉念庭","鈴木大地","野村佑希","福田周平",
            "松田宣浩","安田尚憲","中村剛也","黒川史陽","中島卓也","宗佑磨","今宮健太","藤岡裕大","源田壮亮","茂木栄五郎","石井一成","安達了一","グラシアル","荻野貴司","スパンジェンバーグ","小深田大翔","近藤健介","紅林弘太郎",
            "デスパイネ","角中勝也","栗山巧","村林一輝","淺間大基","吉田正尚","長谷川勇也","藤原恭大","若林楽人","島内宏明","王柏融","佐野皓大",
            "柳田悠岐","岡大海","金子侑司","辰己涼介","西川遥輝","ジョーンズ","栗原陵矢","マーティン","愛斗","岡島豪郎","大田泰示","杉本裕太郎"]
st.write(len(["青柳晃洋","福谷浩司","平良拳太郎","森下暢仁","石川雅規","秋山拓巳","柳裕也","濵口遥大","大瀬良大地","スアレス","西勇輝","大野雄大","大貫晋一","九里亜蓮","小川泰弘","ガンケル","小笠原慎之介","ピープルズ","床田寛樹","田口麗斗",
            "伊藤将司","勝野昌慶","阪口皓亮","野村祐輔","高梨裕稔","馬場皐輔","谷元圭介","山﨑康晃","菊池保則","梅野雄吾","岩崎優","福敬登","エスコバー","塹江敦哉","清水昇","岩貞祐太","祖父江大輔","平田真吾","ケムナ誠","マクガフ","小林慶祐",
            "又吉克樹","砂田毅樹","中田廉","今野龍太","スアレス","R.マルティネス","三嶋一輝","栗林良吏","石山泰稚","梅野隆太郎","木下拓哉","戸柱恭孝","會澤翼","西田明央",
            "マルテ","A.マルティネス","ソト","クロン","中村悠平","糸原健斗","ビシエド","牧秀悟","菊池涼介","内川聖一","大山悠輔","阿部寿樹","柴田竜拓","堂林翔太","松本友",
            "木浪聖也","高橋周平","宮崎敏郎","田中広輔","山田哲人","中野拓夢","京田陽太","大和","小園海斗","村上宗隆","サンズ","福田永将","倉本寿彦","長野久義","西浦直亨",
            "近本光司","根尾昂","佐野恵太","松山竜平","青木宣親","糸井嘉男","大島洋平","神里和毅","西川龍馬","塩見泰隆","佐藤輝明","平田良介","桑原将志","羽月隆太郎","山崎晃大朗",
            "陽川尚将","井領雅貴","オースティン","鈴木誠也","サンタナ"]))



if st.button('予想'):
        import numpy as np
        random=["柳田","千賀","藤原","マーティン","森","外崎","則本","松井","上沢","伊藤","吉田","山本","岡本","菅野","佐藤","藤浪","ビシエド","大野","オースティン","ソト","鈴木","栗林","村上","奥川"]
        one=["千賀","マーティン","森","則本","上沢","吉田","菅野","佐藤","ビシエド","ソト","鈴木","村上"]
        two=["柳田","藤原","外崎","松井","伊藤","山本","岡本","藤浪","大野","オースティン","栗林","奥川"]
        
        if toba=="野﨑康誠":
                one=["戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱"]
                two=["戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱","戸柱"]
        if toba=="佐藤廉":
                one=["源田","源田","源田","源田","源田","源田","衛藤","源田","源田","源田","源田","源田"]
                two=["源田","源田","源田","源田","源田","源田","衛藤","源田","源田","源田","源田","源田"]
        if toba=="大槻亮介":
                one=["三浦","遠藤","斎藤隆","山﨑康晃","ローズ","ブランコ","村田","石井琢朗","筒香","鈴木尚典","高木豊","谷繫"]
                two=["愛萌","愛萌","愛萌","愛萌","愛萌","愛萌","斉藤優里","斉藤優里","斉藤優里","斉藤優里","斉藤優里","斉藤優里"]

        if simulation=="60連目をシミュレーション":
                s=0
                a=0
                b=0
                k=10
                while k>1:
                        main(1)
                        y=np.random.randint(1,1001)
                        se=np.random.randint(1,31)
                        bse=np.random.randint(1,33)
                        if se<=21:
                            series="Series1"
                            se=str(se)
                        elif 21<se:
                            series="Series2"
                            se=str(se-21)
                        if bse<=23:
                            bseries="Series1"
                            bse=str(bse)
                        elif 23<bse:
                            bseries="Series2"
                            bse=str(bse-23)
                        if y<=25:
                                z=np.random.randint(1,11)
                                if z<=5:
                                        s+=1
                                        st.write("S "+one[np.random.randint(0,12)]+" アニバ")
                                        k-=1
                                else:
                                        s+=1
                                        st.write("S "+series+" "+se+"番目に登場した選手")
                                        k-=1
                        elif 25<y<=110:
                                z=np.random.randint(1,11)
                                if z<=3:
                                        a+=1
                                        st.write("A "+one[np.random.randint(0,12)]+" アニバ")
                                        k-=1
                                else:
                                        a+=1
                                        st.write("A "+series+" "+se+"番目に登場した選手")
                                        k-=1
                        else:
                                b+=1
                                st.write("B "+bseries+" "+bse+"番目に登場した選手")
                                k-=1
                if k==1:
                        main(1)
                        st.write("S "+one[int(te)]+" アニバ")
        main(1)
    
        if simulation=="累計報酬をシミュレーション":
                st.write(one[np.random.randint(0,12)])

   
        if toba=="野崎康誠":
                st.write("文字、間違えてませんか？？")

        if toba=="調子くん":
                st.write("アタリが引けるといいね！！")

        if toba=="調子カス":
                st.write("ハズレが引けるといいね！！")
